app/views/homepage/homepage.he.html.erb

		<%= hidden_field_tag(:locale, "he") %>
		<%= select_tag(:h_name, options_for_select(City.pluck(:h_name)), {class: "btn btn-default dropdown-toggle"}) %>
---
SELECT "cities"."h_name" FROM "cities"