app/views/homepage/homepage.html.erb


		<%= select_tag(:h_name, options_for_select(City.pluck(:h_name)), {class: "h-form btn btn-default dropdown-toggle"}) %>
---
SELECT "cities"."name" FROM "cities"