app/controllers/cities_controller.rb

  def show

    @city = City.where(:name => params["id"]).first
---
SELECT "cities".* FROM "cities" WHERE "cities"."name" = 'Tel-Aviv' ORDER BY "cities"."id" ASC LIMIT 1