app/controllers/homepage_controller.rb

  def show_selected
    #sends form to selected view

    #raise params.to_s
    @city = City.where(:name => params["name"]).first if I18n.locale == :en
---
SELECT "cities".* FROM "cities" WHERE "cities"."name" = 'Tel-Aviv' ORDER BY "cities"."id" ASC LIMIT 1