app/controllers/places_controller.rb

SELECT "ratings".* FROM "ratings" WHERE "ratings"."place_id" = 37 AND "ratings"."user_id" = 3 ORDER BY "ratings"."id" ASC LIMIT 1
INSERT INTO "ratings" ("created_at", "place_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Mon, 20 Jan 2014 22:37:36 UTC +00:00], ["place_id", 52], ["updated_at", Mon, 20 Jan 2014 22:37:36 UTC +00:00], ["user_id", 3]]
---
  def show
    if current_user
      if Rating.where(place_id: @place.id, user_id: current_user.id).first
        @rating = Rating.where(place_id: @place.id, user_id: @current_user.id).first
      else
        @rating = Rating.create(place_id: @place.id, user_id: current_user.id, score: 0)

SELECT places.*, (69.09332411348201 * ABS(places.latitude - 32.0885851) * 0.7071067811865475) + (59.836573914187355 * ABS(places.longitude - 34.7823304) * 0.7071067811865475) AS distance, CASE WHEN (places.latitude >= 32.0885851 AND places.longitude >= 34.7823304) THEN 45.0 WHEN (places.latitude < 32.0885851 AND places.longitude >= 34.7823304) THEN 135.0 WHEN (places.latitude < 32.0885851 AND places.longitude < 34.7823304) THEN 225.0 WHEN (places.latitude >= 32.0885851 AND places.longitude < 34.7823304) THEN 315.0 END AS bearing FROM "places" WHERE (places.latitude BETWEEN 32.081348510844464 AND 32.09582168915554 AND places.longitude BETWEEN 34.773788908114234 AND 34.790871891885764 AND places.id != 37) ORDER BY distance ASC
---
  def set_place
    @place = Place.find(params[:id])