app/controllers/ratings_controller.rb

  def update
     logger.debug "bungwipe " + params.to_s + "pin " + current_user.id.to_s
    @rating = Rating.where(:user_id => current_user.id, :place_id => params["place_id"]).first_or_initialize
    @rating.score = params["score"]
    @rating.save
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = 3 AND "ratings"."place_id" = 37 ORDER BY "ratings"."id" ASC LIMIT 1
UPDATE "ratings" SET "score" = ?, "updated_at" = ? WHERE "ratings"."id" = 1  [["score", 5], ["updated_at", Mon, 20 Jan 2014 19:48:03 UTC +00:00]]