app/views/cities/show.html.erb

SELECT "places".* FROM "places" WHERE "places"."city_id" = ?  [["city_id", 1]]
---
<% @places = Place.where(:city_id => @city.id) %>

SELECT "categories".* FROM "categories" INNER JOIN "categories_places" ON "categories"."id" = "categories_places"."category_id" WHERE "categories_places"."place_id" = ?  [["place_id", 59]]
---
					<p>
						<%= place.categories.map(&:name).join(', ') %>