app/views/places/show.html.erb

SELECT "categories".* FROM "categories" INNER JOIN "categories_places" ON "categories"."id" = "categories_places"."category_id" WHERE "categories_places"."place_id" = ?  [["place_id", 37]]
---
			<% if I18n.locale == :en %>
			<%= @place.categories.map(&:name).join(', ') %>